SparkEVO/SparkEVO-ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.opt=Optimize
menu.hwrev=Hardware revision

# SparkEVO 2 (Native USB Port)
# --------------------------------------
sparkevo_two_native.name=SparkEVO 2 (Native USB port)
sparkevo_two_native.vid.0=0x2341
sparkevo_two_native.pid.0=0x804d
sparkevo_two_native.vid.1=0x2341
sparkevo_two_native.pid.1=0x004d
sparkevo_two_native.vid.2=0x2341
sparkevo_two_native.pid.2=0x824d
sparkevo_two_native.vid.3=0x2341
sparkevo_two_native.pid.3=0x024d
sparkevo_two_native.upload_port.0.vid=0x2341
sparkevo_two_native.upload_port.0.pid=0x804d
sparkevo_two_native.upload_port.1.vid=0x2341
sparkevo_two_native.upload_port.1.pid=0x004d
sparkevo_two_native.upload_port.2.vid=0x2341
sparkevo_two_native.upload_port.2.pid=0x824d
sparkevo_two_native.upload_port.3.vid=0x2341
sparkevo_two_native.upload_port.3.pid=0x024d
sparkevo_two_native.upload_port.4.board=sparkevo_two_native

sparkevo_two_native.upload.tool=bossac
sparkevo_two_native.upload.tool.default=bossac
sparkevo_two_native.upload.tool.network=arduino_ota
sparkevo_two_native.upload.protocol=sam-ba
sparkevo_two_native.upload.maximum_size=262144
sparkevo_two_native.upload.maximum_data_size=32768
sparkevo_two_native.upload.use_1200bps_touch=true
sparkevo_two_native.upload.wait_for_upload_port=true
sparkevo_two_native.upload.native_usb=true
sparkevo_two_native.build.mcu=cortex-m0plus
sparkevo_two_native.build.f_cpu=48000000L
sparkevo_two_native.build.usb_product="SparkEVO 2"
sparkevo_two_native.build.usb_manufacturer="SparkEVO"
sparkevo_two_native.build.board=SAMD_ZERO
sparkevo_two_native.build.core=arduino
sparkevo_two_native.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
sparkevo_two_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sparkevo_two_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
sparkevo_two_native.build.variant=arduino_zero
sparkevo_two_native.build.variant_system_lib=
sparkevo_two_native.build.vid=0x2341
sparkevo_two_native.build.pid=0x804d
sparkevo_two_native.bootloader.tool=openocd
sparkevo_two_native.bootloader.tool.default=openocd
sparkevo_two_native.bootloader.file=zero/samd21_sam_ba.bin

# Menu
sparkevo_two_native.menu.opt.small=Small (-Os) (standard)
sparkevo_two_native.menu.opt.small.build.flags.optimize=-Os
sparkevo_two_native.menu.opt.fast=Fast (-O2)
sparkevo_two_native.menu.opt.fast.build.flags.optimize=-O2
sparkevo_two_native.menu.opt.faster=Faster (-O3)
sparkevo_two_native.menu.opt.faster.build.flags.optimize=-O3

sparkevo_two_native.menu.hwrev.d1=Dev 1
sparkevo_two_native.menu.hwrev.d1.build.extra_flags=-DHW_REVISION_D1 -D__SAMD21G18A__ {build.usb_flags}
sparkevo_two_native.menu.hwrev.r1=Release 1
sparkevo_two_native.menu.hwrev.r1.build.extra_flags=-DHW_REVISION_R1 -D__SAMD21G18A__ {build.usb_flags}